miniwinwm/miniwinwm/Renesas/RX65N/MiniWinFile/src/smc_gen/r_usb_basic/src/driver/r_usb_pdriver.c
/******************************************************************************
 Function Name   : usb_peri_resume
 Description     : Peripheral Devices Class resume function
 Arguments       : usb_utr_t    *ptr        : Not used
                 : uint16_t     data1       : Not used
                 : uint16_t     data2       : Not used
 Return value    : none
 ******************************************************************************/
void usb_peri_resume(usb_utr_t *ptr, uint16_t data1, uint16_t data2)
{
    usb_ctrl_t ctrl;

    ctrl.module = USB_CFG_USE_USBIP;
    usb_set_event(USB_STS_RESUME, &ctrl);
} /* End of function usb_peri_resume() */

/******************************************************************************
 Function Name   : usb_peri_interface
 Description     : Peripheral Devices Class set interface function
 Arguments       : usb_utr_t    *ptr        : Not used
                 : uint16_t     data1       : Not used
                 : uint16_t     data2       : Not used
 Return value    : none
 ******************************************************************************/
void usb_peri_interface(usb_utr_t *ptr, uint16_t data1, uint16_t data2)
{
#if defined(USB_CFG_PMSC_USE)
    usb_pmsc_receive_cbw();
#else   /* defined(USB_CFG_PMSC_USE) */
    /* Non processing */
#endif  /* defined(USB_CFG_PMSC_USE) */
} /* End of function usb_peri_interface() */

#if defined(USB_CFG_PVND_USE)
/******************************************************************************
 Function Name   : usb_pvnd_read_complete
 Description     : CallBack Function
 Argument        : usb_utr_t *mess           : Transfer result message
 Return          : none
 ******************************************************************************/
void usb_pvnd_read_complete (usb_utr_t *mess, uint16_t data1, uint16_t data2)
{
    usb_ctrl_t ctrl;

    /* Set Receive data length */
    ctrl.size = g_usb_read_request_size[USB_CFG_USE_USBIP][mess->keyword] - mess->tranlen;
    ctrl.pipe = mess->keyword; /* Pipe number setting */
    ctrl.type = USB_PVND; /* Device class setting  */
    switch (mess->status)
    {
        case USB_DATA_OK :
            ctrl.status = USB_SUCCESS;
        break;
        case USB_DATA_SHT :
            ctrl.status = USB_ERR_SHORT;
        break;
        case USB_DATA_OVR :
            ctrl.status = USB_ERR_OVER;
        break;
        case USB_DATA_ERR :
        default :
            ctrl.status = USB_ERR_NG;
        break;
    }
    ctrl.module = USB_CFG_USE_USBIP;
    usb_set_event(USB_STS_READ_COMPLETE, &ctrl);
} /* End of function usb_pvnd_read_complete() */

/******************************************************************************
 Function Name   : usb_pvnd_write_complete
 Description     : CallBack Function
 Argument        : usb_utr_t *mess           : Transfer result message
 Return          : none
 ******************************************************************************/
void usb_pvnd_write_complete (usb_utr_t *mess, uint16_t data1, uint16_t data2)
{
    usb_ctrl_t ctrl;

    ctrl.pipe = mess->keyword; /* Pipe number setting */
    ctrl.type = USB_PVND; /* CDC Control class  */
    if (USB_DATA_NONE == mess->status)
    {
        ctrl.status = USB_SUCCESS;
    }
    else
    {
        ctrl.status = USB_ERR_NG;
    }
    ctrl.module = USB_CFG_USE_USBIP;
    usb_set_event(USB_STS_WRITE_COMPLETE, &ctrl);
} /* End of function usb_pvnd_write_complete() */
#endif /* defined(USB_CFG_PVND_USE) */

#endif  /* (USB_CFG_MODE & USB_CFG_PERI) == USB_CFG_REPI */

/******************************************************************************
 End  Of File
 ******************************************************************************/
